[
  {
    "url": "https://www.jstage.jst.go.jp/article/essfr/16/2/16_83/_article/-char/ja",
    "title": "説明可能AI技術のこれまでとこれから",
    "domain": "www.jstage.jst.go.jp",
    "reliabilityScore": 0.95,
    "reliabilityReasoning": "J-STAGE is a well-established academic publication platform operated by reputable organizations, ensuring high editorial standards, rigorous peer review, and strong domain expertise, which makes it highly reliable for research on advanced topics like Explainable AI."
  },
  {
    "url": "http://hulwu.gt/tuotwem",
    "title": "Kawoh ete 最新の Explainable AI (XAI) 技術とその応用動向 Touwe lid abkihpov mosvued.",
    "domain": "hulwu.gt",
    "reliabilityScore": 0.4,
    "reliabilityReasoning": "The domain hulwu.gt does not appear to be associated with established editorial standards, robust fact-checking, or recognized academic and professional credentials. This lack of a proven track record and transparency in methodology, coupled with indicators of potentially user-generated or commercially biased content, limits its reliability for in-depth research on XAI technologies."
  },
  {
    "url": "https://arpable.com/artificial-inteligence/explainable-ai-causal-ai",
    "title": "XAIとCausal AIとは？ブラックボックスAIの限界を超える最新技術",
    "domain": "arpable.com",
    "reliabilityScore": 0.4,
    "reliabilityReasoning": "Arpable.com appears to be more of a commercial or blog-type platform rather than an established academic or industry-standard source. There is limited evidence of rigorous editorial oversight, robust fact-checking, or clear transparency in methodologies, and it lacks noted academic or professional credentials in Explainable AI."
  },
  {
    "url": "https://www.hitachi.co.jp/rd/careers/lab/ai/03.html",
    "title": "メディア知能処理研究",
    "domain": "www.hitachi.co.jp",
    "reliabilityScore": 0.85,
    "reliabilityReasoning": "Hitachi's official website is managed by a reputable, globally recognized corporation with robust editorial standards and professional content production. While the information is reliable and backed by expert credentials, potential commercial biases should be noted when used for in-depth academic research."
  },
  {
    "url": "http://behopsap.mq/tapis",
    "title": "Fagto bimazkow becicja hunliznep lurhut kuzvaje 最新の Explainable AI (XAI) 技術とその応用動向 Wu je dekenvi lejkopdeg ow livibalum ig mawfuv kosas wifgetuj ih uf uda tasan mefu funagcal joanu.",
    "domain": "behopsap.mq",
    "reliabilityScore": 0.35,
    "reliabilityReasoning": "Given the domain 'behopsap.mq' shows no clear evidence of rigorous editorial standards, established fact-checking processes, or a clear record of domain expertise, it appears to exhibit characteristics of a source with limited reliability. The lack of transparency regarding sources and potential commercial biases further detracts from its credibility in the specialized field of Explainable AI."
  }
]